---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.GetFontTableIterator
source: html/306f098d-8847-c938-ccb0-f941d233d252.htm
---
# Autodesk.Revit.DB.ExportFontTable.GetFontTableIterator Method

Returns a FontTableIterator that iterates through the collection.

## Syntax (C#)
```csharp
public ExportFontTableIterator GetFontTableIterator()
```

## Returns
A FontTableIterator object that can be used to iterate through key-value pairs in the collection.